program 2/app/controllers/admins_controller.rb

  def create
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save
---
INSERT INTO "admins" ("username", "name", "password_digest", "phone", "address", "creditnumber", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @admin.update(admin_params)
---
UPDATE "admins" SET "name" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["name", "Administrator1"], ["updated_at", "2023-09-29 16:41:47.504662"], ["id", 2]]

  def destroy
    @admin.destroy
---
DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 1]]

    def set_admin
      #@admin = Admin.find(params[:id])
      @admin = Admin.find(session[:admin_id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]