program 2/app/controllers/application_controller.rb

SELECT "passengers".* FROM "passengers" WHERE "passengers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def current_user
    if session[:user_id]
      @current_user ||= Passenger.find(session[:user_id])

SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def admin_user
    if session[:admin_id]
      @admin_user ||= Admin.find(session[:admin_id])