program 2/app/controllers/passengers_controller.rb

  def index
    @passengers = Passenger.all
---
SELECT "passengers".* FROM "passengers"

  def create
    @passenger = Passenger.new(passenger_params)

    respond_to do |format|
      if @passenger.save
---
INSERT INTO "passengers" ("name", "email", "password_digest", "phone", "address", "creditnumber", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @passenger.update(passenger_params)
---
UPDATE "passengers" SET "phone" = ?, "creditnumber" = ?, "updated_at" = ? WHERE "passengers"."id" = ?  [["phone", "9849849840"], ["creditnumber", "1111222244446665"], ["updated_at", "2023-10-05 22:31:40.271074"], ["id", 8]]

  def destroy
    respond_to do |format|
      if(admin_user)
        format.html { redirect_to admins_url, notice: "Passenger was successfully destroyed." }
      else
        format.html { redirect_to logout_path, notice: "Passenger was successfully destroyed." }
      end
      format.json { head :no_content }
    end
    @reviews = Review.where(passengerid: params[:id])
    @tickets = Ticket.where(passengerid: params[:id])

    @reviews.each do |review|
      review.destroy
    end

    @tickets.each do |ticket|
      ticket.destroy
    end
    @passenger.destroy
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."passengerid" = ?  [["passengerid", "7"]]
SELECT "tickets".* FROM "tickets" WHERE "tickets"."passengerid" = ?  [["passengerid", "7"]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."passengerid" = ?  [["passengerid", "5"]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 10]]
SELECT "tickets".* FROM "tickets" WHERE "tickets"."passengerid" = ?  [["passengerid", "5"]]
DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 30]]
DELETE FROM "passengers" WHERE "passengers"."id" = ?  [["id", 5]]

    def set_passenger
      @passenger = Passenger.find(params[:id])
---
SELECT "passengers".* FROM "passengers" WHERE "passengers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]