program 2/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("passengerid", "trainid", "rating", "feedback", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["passengerid", "1"], ["trainid", "1"], ["rating", 4], ["feedback", "nice"], ["created_at", "2023-09-30 17:30:48.994290"], ["updated_at", "2023-09-30 17:30:48.994290"]]
---
  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save

UPDATE "reviews" SET "trainid" = ?, "rating" = ?, "feedback" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["trainid", "4"], ["rating", 4], ["feedback", "nice"], ["updated_at", "2023-10-01 18:19:19.456432"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @review.update(review_params)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."passengerid" = ?  [["passengerid", "4"]]
---
  def list_by_user
    @user = params[:user]
    @user_reviews = Review.where(passengerid: @user)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."trainid" = ?  [["trainid", "5"]]
---
  def list_by_train
    @train = params[:train]
    @train_reviews = Review.where(trainid: @train)