program 2/app/controllers/sessions_controller.rb

  def create
    if params[:email] == "admin"
      adm = Admin.find_by_username(params[:email])
      if adm && adm.authenticate(params[:password])
        session[:admin_id] = adm.id
        redirect_to admins_url('index'), notice: "Admin Logged in!"
      end
    elsif params[:email] =~ /@/
      user = Passenger.find_by_email(params[:email])
---
SELECT "admins".* FROM "admins" WHERE "admins"."username" = ? LIMIT ?  [["username", "admin"], ["LIMIT", 1]]
SELECT "passengers".* FROM "passengers" WHERE "passengers"."email" = ? LIMIT ?  [["email", "passenger1@pass.com"], ["LIMIT", 1]]