program 2/app/controllers/tickets_controller.rb

SELECT "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "trains" SET "traincapacity" = ?, "updated_at" = ? WHERE "trains"."id" = ?  [["traincapacity", 97], ["updated_at", "2023-10-01 01:40:25.323010"], ["id", 5]]
INSERT INTO "tickets" ("passengerid", "trainid", "confirmationnumber", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["passengerid", "4"], ["trainid", "5"], ["confirmationnumber", 765607], ["created_at", "2023-10-01 01:40:25.326648"], ["updated_at", "2023-10-01 01:40:25.326648"]]
---
  def create
    @ticket = Ticket.new(ticket_params)

    train_id = @ticket.trainid

train = Train.find_by(id: train_id)

if train
  train.update(traincapacity: train.traincapacity - 1)
end


    respond_to do |format|
      if @ticket.save

UPDATE "tickets" SET "passengerid" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["passengerid", "4"], ["updated_at", "2023-09-30 19:25:50.500033"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @ticket.update(ticket_params)

DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 23]]
SELECT "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "trains" SET "traincapacity" = ?, "updated_at" = ? WHERE "trains"."id" = ?  [["traincapacity", 98], ["updated_at", "2023-10-01 01:40:51.099093"], ["id", 6]]
---
  def destroy
  # Retrieve the trainnumber from the @ticket
    train_id = @ticket.trainid


  @ticket.destroy

    train = Train.find_by(id: train_id)

if train
  train.update(traincapacity: train.traincapacity + 1)