program 2/app/controllers/trains_controller.rb

  def index
    @trains = Train.all
    @high_rated_trains = Train.joins('INNER JOIN reviews ON trains.id = reviews.trainid')
                            .where('reviews.rating > ?', 3)
                            .group('trains.id')
---
SELECT "trains".* FROM "trains" WHERE "trains"."trainid" IS NULL AND (trainid IN (SELECT trainid FROM reviews WHERE rating > 3))
SELECT "trains".* FROM "trains" INNER JOIN reviews ON trains.id = reviews.trainid WHERE (reviews.rating > 3) GROUP BY "trains"."id"

  def create
    @train = Train.new(train_params)

    respond_to do |format|
      if @train.save
---
INSERT INTO "trains" ("trainnumber", "departurestation", "terminationstation", "departuredate", "departuretime", "arrivaldate", "arrivaltime", "ticketprice", "traincapacity", "seatsleft", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @train.destroy
---
DELETE FROM "trains" WHERE "trains"."id" = ?  [["id", 6]]

  def list_by_station
    @station_name = params[:station_name]
    @trains_departing = Train.where(departurestation: @station_name)
    @trains_terminating = Train.where(terminationstation: @station_name)
---
SELECT "trains".* FROM "trains" WHERE "trains"."departurestation" = ?  [["departurestation", "Raleigh"]]
SELECT "trains".* FROM "trains" WHERE "trains"."terminationstation" = ?  [["terminationstation", "Raleigh"]]

  def get_upcoming_available_trains
    Rails.logger.debug("Current Time: #{Time.now.utc}")
    @trains_upcoming = Train.where("departuretime > ? AND seatsleft > 0", Time.now.utc)
---
SELECT "trains".* FROM "trains" WHERE (departuretime > '2023-09-30 22:48:01.194512' AND seatsleft > 0)

  def get_previous_available_trains
    Rails.logger.debug("Current Time: #{Time.now.utc}")
    @trains_previous = Train.where("departuretime < ? AND seatsleft > 0", Time.now.utc)
---
SELECT "trains".* FROM "trains" WHERE (departuretime < '2023-10-01 00:28:34.727726' AND seatsleft > 0)

  def search
    train_number = params[:train_number]

    @train = Train.find_by(id: train_number)
---
SELECT "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

    def set_train
      @train = Train.find(params[:id])
---
SELECT "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]